hugo/content/objective-c/arc.org
#+TITLE: Objective-C  の MRC と ARC と オートリリースプール
# -*- coding:utf-8 -*-
#+AUTHOR: ifritJP
#+STARTUP: nofold
#+OPTIONS: ^:{}

Objective-C(以降 objc) のメモリ管理について説明する。

ここで言うメモリ管理とは以下を指す。
- OS から取得したメモリをどのように開放するか？
- 開放処理をどの様にコード上に書くか？

なお、objc のメモリ管理には次の2つのモードがある。

- MRC(Manual Reference Counting)
- ARC(Automatic Reference Counting)

このドキュメントでは、この 2 つのモードと、
 オートリリースプールについて説明する。

* 実行環境

このドキュメントを書くにあたって、
objc のコードをビルドして動作させた結果を確認している。

その動作確認環境を用意する際、
最も簡単なのは Mac を使うことだが、
残念ながら Mac を持っていない。
そこで、ここでは次の Docker 環境を利用して objc の動作確認を行なった。

<https://hub.docker.com/r/doratex/clang9-objc2>

上記 docker イメージについては以下を参照。

<https://qiita.com/doraTeX/items/c35e25c2afbb48a1469f>

* サンプルクラス

メモリの開放タイミングを確認するため、次のクラス MyClass を宣言している。

このクラスは、オブジェクトが開放される直前に次のメッセージを出力する。

: MyClass dealloc -- obj:%d

ここで、 =%d= にはオブジェクト生成時に与えた整数値が入る。

- sub.h

#+BEGIN_SRC objc
#import <Foundation/Foundation.h>

@interface MyClass : NSObject
@property (nonatomic) int val;
- (instancetype)init:(int)val;
- (void)dealloc;
@end
#+END_SRC

- sub.m

#+BEGIN_SRC objc
#import <sub.h>

@implementation MyClass
- (instancetype)init:(int)val {
    self = [super init];
    self.val = val;
    return self;
}

- (void)dealloc {
  NSLog(@"MyClass dealloc -- obj:%d", self.val);
}
@end
#+END_SRC



* MRC

MRC は、古典的なメモリ管理であり、
その名の通り確保したメモリ開放の API を
コード上に組み込んでおく必要がある。

例えば以下のような感じで、 alloc で確保したオブジェクトに対して
明示的に release をコールして開放を行なう。

#+BEGIN_SRC objc
    MyClass *obj = [[MyClass alloc] init:0];
    [obj release];
#+END_SRC

なお、このコードを動かすと次のメッセージが出力される。

: MyClass dealloc -- obj:0

** 参照カウンタ

objc でヒープ内に確保したオブジェクトは、参照カウンタを持つ。

この参照カウンタが 0 になったタイミングで、そのオブジェクトは開放される。

参照カウンタの制御に関するメソッドには次がある。

- alloc
  - オブジェクトをヒープ内に確保し、参照カウンタを 1 にセットする
- retain
  - 参照カウンタをインクリメントする
- release
  - 参照カウンタをデクリメントして、0 になった場合にオブジェクトを開放する

以下のコードを実行すると、

#+BEGIN_SRC objc
    obj = [[MyClass alloc] init:1]; /* step1, 参照カウンタ: 1 */
    [obj retain];                   /* step2, 参照カウンタ: 2 */
    NSLog( @"release-1" );          /* step2-2 */
    [obj release];                  /* step3, 参照カウンタ: 1 */
    NSLog( @"release-2" );          /* step3-2 */
    [obj release];                  /* step4, 参照カウンタ: 0 */
    NSLog( @"release-3" );          /* step4-2 */
#+END_SRC

この時の出力は次になる。

#+BEGIN_SRC objc
release-1
release-2
MyClass dealloc -- obj:1
release-3
#+END_SRC

この時の参照カウンタに着目して動作を説明すると、以下の通り。

- step1 の段階で参照カウンタが 1 にセットされる
- step2 では、retain によってインクリメンされて参照カウンタは 2 になる。
- step3 では、release によって参照カウンタがデクリメントされる。
  デクリメント後の参照カウンタは 1 なので、オブジェクトはまだ開放されない
- step4 では、release によって参照カウンタがデクリメントされる。
  デクリメント後の参照カウンタは 0 なので、オブジェクトは開放される。

* オートリリースプール

MRC でよくある問題は、 release し忘れによるメモリリークである。

確保したヒープオブジェクトに対して release しないと、
そのメモリはプログラム自体が終了しない限りはヒープ内に残り続ける。
これによりメモリが圧迫されアプリが異常終了したり、
OS 自体の挙動が重くなったりすることがある。

この release の実行を手助けするのが、 *オートリリースプール* である。

** オートリリースプールのコンセプト

オートリリースプールのコンセプトは、次の通りである。

『ヒープオブジェクト個々に対して release するのは面倒なので、
ヒープオブジェクトをグループでまとめて管理するクラスを作成し、
そのクラスのインスタンスを開放するタイミングで、
その管理クラスインスタンスに登録されているヒープオブジェクトに対して
まとめて release を呼ぶ』


オートリリースプールには、 次の 2 つの生成方法がある。
- NSAutoreleasePool のインスタンスを生成する
- =@autoreleasepool= ブロックを使用する

