hugo/public/objective-c/arc/index.html
<!DOCTYPE html>
<html lang="ja">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>Objective-C  の MRC と ARC と オートリリースプール - 公開技術情報</title>
<meta name="generator" content="Hugo 0.118.2">
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/objective-c/arc/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="Objective-C  の MRC と ARC と オートリリースプール" />
<meta property="og:description" content="Objective-C(以降 objc) のメモリ管理について説明する。 ここで言うメモリ管理とは以下を指す。 OS から取得したメモリをどのように開放するか？" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/objective-c/arc/" /><meta property="article:section" content="objective-c" />

<meta property="og:site_name" content="公開技術情報" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Objective-C  の MRC と ARC と オートリリースプール"/>
<meta name="twitter:description" content="Objective-C(以降 objc) のメモリ管理について説明する。 ここで言うメモリ管理とは以下を指す。 OS から取得したメモリをどのように開放するか？"/>
<meta itemprop="name" content="Objective-C  の MRC と ARC と オートリリースプール">
<meta itemprop="description" content="Objective-C(以降 objc) のメモリ管理について説明する。 ここで言うメモリ管理とは以下を指す。 OS から取得したメモリをどのように開放するか？">

<meta itemprop="wordCount" content="2840">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_wasm/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>Objective-C  の MRC と ARC と オートリリースプール</h1>

<p>
Objective-C(以降 objc) のメモリ管理について説明する。</p>
<p>
ここで言うメモリ管理とは以下を指す。</p>
<ul>
<li>OS から取得したメモリをどのように開放するか？</li>
<li>開放処理をどの様にコード上に書くか？</li>
</ul>
<p>なお、objc のメモリ管理には次の2つのモードがある。</p>
<ul>
<li>MRC(Manual Reference Counting)</li>
<li>ARC(Automatic Reference Counting)</li>
</ul>
<p>このドキュメントでは、この 2 つのモードと、
 オートリリースプールについて説明する。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
実行環境
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
このドキュメントを書くにあたって、
objc のコードをビルドして動作させた結果を確認している。</p>
<p>
その動作確認環境を用意する際、
最も簡単なのは Mac を使うことだが、
残念ながら Mac を持っていない。
そこで、ここでは次の Docker 環境を利用して objc の動作確認を行なった。</p>
<p>
&lt;<a href="https://hub.docker.com/r/doratex/clang9-objc2">https://hub.docker.com/r/doratex/clang9-objc2</a>&gt;</p>
<p>
上記 docker イメージについては以下を参照。</p>
<p>
&lt;<a href="https://qiita.com/doraTeX/items/c35e25c2afbb48a1469f">https://qiita.com/doraTeX/items/c35e25c2afbb48a1469f</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
サンプルクラス
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
メモリの開放タイミングを確認するため、次のクラス MyClass を宣言している。</p>
<p>
このクラスは、オブジェクトが開放される直前に次のメッセージを出力する。</p>
<pre class="example">
MyClass dealloc -- obj:%d
</pre>
<p>
ここで、 <code class="verbatim">%d</code> にはオブジェクト生成時に与えた整数値が入る。</p>
<ul>
<li>sub.h</li>
</ul>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="cp">#import &lt;Foundation/Foundation.h&gt;
</span></span></span><span class="line"><span class="cl"><span class="cp"></span>
</span></span><span class="line"><span class="cl"><span class="k">@interface</span> <span class="nc">MyClass</span> : <span class="nc">NSObject</span>
</span></span><span class="line"><span class="cl"><span class="k">@property</span> <span class="p">(</span><span class="k">nonatomic</span><span class="p">)</span> <span class="kt">int</span> <span class="n">val</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">-</span> <span class="p">(</span><span class="kt">instancetype</span><span class="p">)</span><span class="nf">init:</span><span class="p">(</span><span class="kt">int</span><span class="p">)</span><span class="nv">val</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">-</span> <span class="p">(</span><span class="kt">void</span><span class="p">)</span><span class="nf">dealloc</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="k">@end</span></span></span></code></pre></div>
</div>
<ul>
<li>sub.m</li>
</ul>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="cp">#import &lt;sub.h&gt;
</span></span></span><span class="line"><span class="cl"><span class="cp"></span>
</span></span><span class="line"><span class="cl"><span class="k">@implementation</span> <span class="nc">MyClass</span>
</span></span><span class="line"><span class="cl"><span class="p">-</span> <span class="p">(</span><span class="kt">instancetype</span><span class="p">)</span><span class="nf">init:</span><span class="p">(</span><span class="kt">int</span><span class="p">)</span><span class="nv">val</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nb">self</span> <span class="o">=</span> <span class="p">[</span><span class="nb">super</span> <span class="n">init</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">    <span class="nb">self</span><span class="p">.</span><span class="n">val</span> <span class="o">=</span> <span class="n">val</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="nb">self</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">-</span> <span class="p">(</span><span class="kt">void</span><span class="p">)</span><span class="nf">dealloc</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="n">NSLog</span><span class="p">(</span><span class="s">@&#34;MyClass dealloc -- obj:%d&#34;</span><span class="p">,</span> <span class="nb">self</span><span class="p">.</span><span class="n">val</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span>
</span></span><span class="line"><span class="cl"><span class="k">@end</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
MRC
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
MRC は、古典的なメモリ管理であり、
その名の通り確保したメモリ開放の API を
コード上に組み込んでおく必要がある。</p>
<p>
例えば以下のような感じで、 alloc で確保したオブジェクトに対して
明示的に release をコールして開放を行なう。</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl">    <span class="n">MyClass</span> <span class="o">*</span><span class="n">obj</span> <span class="o">=</span> <span class="p">[[</span><span class="n">MyClass</span> <span class="n">alloc</span><span class="p">]</span> <span class="nl">init</span><span class="p">:</span><span class="mi">0</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">    <span class="p">[</span><span class="n">obj</span> <span class="k">release</span><span class="p">];</span></span></span></code></pre></div>
</div>
<p>
なお、このコードを動かすと次のメッセージが出力される。</p>
<pre class="example">
MyClass dealloc -- obj:0
</pre>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
参照カウンタ
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
objc でヒープ内に確保したオブジェクトは、参照カウンタを持つ。</p>
<p>
この参照カウンタが 0 になったタイミングで、そのオブジェクトは開放される。</p>
<p>
参照カウンタの制御に関するメソッドには次がある。</p>
<ul>
<li>
<p>alloc</p>
<ul>
<li>オブジェクトをヒープ内に確保し、参照カウンタを 1 にセットする</li>
</ul>
</li>
<li>
<p>retain</p>
<ul>
<li>参照カウンタをインクリメントする</li>
</ul>
</li>
<li>
<p>release</p>
<ul>
<li>参照カウンタをデクリメントして、0 になった場合にオブジェクトを開放する</li>
</ul>
</li>
</ul>
<p>以下のコードを実行すると、</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl">    <span class="n">obj</span> <span class="o">=</span> <span class="p">[[</span><span class="n">MyClass</span> <span class="n">alloc</span><span class="p">]</span> <span class="nl">init</span><span class="p">:</span><span class="mi">1</span><span class="p">];</span> <span class="cm">/* step1, 参照カウンタ: 1 */</span>
</span></span><span class="line"><span class="cl">    <span class="p">[</span><span class="n">obj</span> <span class="k">retain</span><span class="p">];</span>                   <span class="cm">/* step2, 参照カウンタ: 2 */</span>
</span></span><span class="line"><span class="cl">    <span class="n">NSLog</span><span class="p">(</span> <span class="s">@&#34;release-1&#34;</span> <span class="p">);</span>          <span class="cm">/* step2-2 */</span>
</span></span><span class="line"><span class="cl">    <span class="p">[</span><span class="n">obj</span> <span class="k">release</span><span class="p">];</span>                  <span class="cm">/* step3, 参照カウンタ: 1 */</span>
</span></span><span class="line"><span class="cl">    <span class="n">NSLog</span><span class="p">(</span> <span class="s">@&#34;release-2&#34;</span> <span class="p">);</span>          <span class="cm">/* step3-2 */</span>
</span></span><span class="line"><span class="cl">    <span class="p">[</span><span class="n">obj</span> <span class="k">release</span><span class="p">];</span>                  <span class="cm">/* step4, 参照カウンタ: 0 */</span>
</span></span><span class="line"><span class="cl">    <span class="n">NSLog</span><span class="p">(</span> <span class="s">@&#34;release-3&#34;</span> <span class="p">);</span>          <span class="cm">/* step4-2 */</span></span></span></code></pre></div>
</div>
<p>
この時の出力は次になる。</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="k">release</span><span class="o">-</span><span class="mi">1</span>
</span></span><span class="line"><span class="cl"><span class="k">release</span><span class="o">-</span><span class="mi">2</span>
</span></span><span class="line"><span class="cl"><span class="n">MyClass</span> <span class="n">dealloc</span> <span class="o">--</span> <span class="nl">obj</span><span class="p">:</span><span class="mi">1</span>
</span></span><span class="line"><span class="cl"><span class="k">release</span><span class="o">-</span><span class="mi">3</span></span></span></code></pre></div>
</div>
<p>
この時の参照カウンタに着目して動作を説明すると、以下の通り。</p>
<ul>
<li>step1 の段階で参照カウンタが 1 にセットされる</li>
<li>step2 では、retain によってインクリメンされて参照カウンタは 2 になる。</li>
<li>step3 では、release によって参照カウンタがデクリメントされる。
デクリメント後の参照カウンタは 1 なので、オブジェクトはまだ開放されない</li>
<li>step4 では、release によって参照カウンタがデクリメントされる。
デクリメント後の参照カウンタは 0 なので、オブジェクトは開放される。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
オートリリースプール
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
MRC でよくある問題は、 release し忘れによるメモリリークである。</p>
<p>
確保したヒープオブジェクトに対して release しないと、
そのメモリはプログラム自体が終了しない限りはヒープ内に残り続ける。
これによりメモリが圧迫されアプリが異常終了したり、
OS 自体の挙動が重くなったりすることがある。</p>
<p>
この release の実行を手助けするのが、 <strong>オートリリースプール</strong> である。</p>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
オートリリースプールのコンセプト
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
オートリリースプールのコンセプトは、次の通りである。</p>
<p>
『ヒープオブジェクト個々に対して release するのは面倒なので、
ヒープオブジェクトをグループでまとめて管理するクラスを作成し、
そのクラスのインスタンスを開放するタイミングで、
その管理クラスインスタンスに登録されているヒープオブジェクトに対して
まとめて release を呼ぶ』</p>
<p>
オートリリースプールには、 次の 2 つの生成方法がある。</p>
<ul>
<li>NSAutoreleasePool のインスタンスを生成する</li>
<li><code class="verbatim">@autoreleasepool</code> ブロックを使用する</li>
</ul>
</div>
</div>
