hugo/content/objective-c/arc.org
** NSAutoreleasePool のサンプル

NSAutoreleasePool のサンプル を以下に示す。

#+BEGIN_SRC objc
{
  NSAutoreleasePool *pool = [[NSAutoreleasePool alloc] init];

  MyClass *obj;
  obj = [[[MyClass alloc] init:0]autorelease];
  obj = [[[MyClass alloc] init:1]autorelease];

  NSLog( @"NSAutoreleasePool-0" );
  [pool release];
  NSLog( @"NSAutoreleasePool-1" );
}
#+END_SRC

上記サンプルを解説すると、

- =[[NSAutoreleasePool alloc] init]= によって、オートリリースプールを生成する
- =[pool release];= によって、オートリリースプールを開放する
- 上記処理の間に *autorelease メソッド* が呼ばれたヒープオブジェクトは、
  オートリリースプールに登録され、オートリリースプール開放時に、
  登録されているヒープオブジェクト自体も release される。

上記サンプルの出力は以下の通り。

#+BEGIN_SRC objc
NSAutoreleasePool-0
MyClass dealloc -- obj:1
MyClass dealloc -- obj:0
NSAutoreleasePool-1
#+END_SRC

上記出力を見ると、 =[pool release];= によって、
オートリリースプールに登録されている
ヒープオブジェクトの release が呼ばれ開放されていることが分かる。


** =@autoreleasepool= のサンプル

=@autoreleasepool= は、
 NSAutoreleasePool のシンタックスシュガーである。

次のコードと、

#+BEGIN_SRC objc
{
  NSAutoreleasePool *pool = [[NSAutoreleasePool alloc] init];
  // some codes
  [pool release];
}
#+END_SRC

次のコードは等価である。

#+BEGIN_SRC objc
@autoreleasepool {
  // some codes
}
#+END_SRC


** オートリリースプールの注意点

オートリリースプールを利用することで、メモリ管理の手間を削減できる。

一方で、メモリの開放タイミングがオートリリースプール開放時になるため、
細かいメモリの開放制御を行えないデメリットもある。

例えば、非常に大きいサイズのメモリを確保するような場合、
オートリリースプールに開放処理を任せてしまうと、
メモリ開放が後回しになってしまってヒープメモリを
圧迫してしまう可能性がある。

オートリリースプールを使用する場合は、
オートリリースプール自体のライフサイクルを十分検討する必要がある。

* ARC

オートリリースプールは、 
MRC で確保したヒープオブジェクトを登録することで
release を一括処理することを目的としていた。
そして、オートリリースプール自体の宣言は
依然としてコード上に記述する必要がある。

一方で ARC は、基本的にコード上には何も記述する必要がない。
ただし、 ARC は MRC 上で成り立っている。

これは、 retain や release を開発者がコードに記述する代わりに
ARC のランタイムで実行時に等価の処理を行なうようになる、
ということである。

つまり、ARC は「変数がスマートポインタになる」と考えれば良い。


** サンプル

次に ARC によるメモリ開放タイミングのサンプルを示す。

#+BEGIN_SRC objc
  MyClass *obj = [[MyClass alloc] init:2];
  obj = [[MyClass alloc] init:3];
  obj = nil;
  NSLog(@"test");
#+END_SRC

- =[[MyClass alloc] init:2]= で、確保したオブジェクトが obj に代入される
- =[[MyClass alloc] init:3]= で、確保したオブジェクトが obj に代入される
- この時、元々 obj に格納されていたオブジェクトの release が呼ばれ、開放される
- =obj = nil= で元々 obj に格納されていたオブジェクトの release が呼ばれ、開放される


#+BEGIN_SRC objc
MyClass dealloc -- obj:2
MyClass dealloc -- obj:3
test
#+END_SRC

** _strong, _weak 

ARC では、参照の度合いによって _strong, _weak の違いがある。
_strong は前述の通り変数がスマートポインタになる。
一方で _weak は参照だけして retain, release を行なわない。

なお、 _strong, _weak どちらも宣言しない場合はデフォルト _strong になる。

_weak は、循環参照に対処するケースで利用する。

