hugo/public/objective-c/arc/index.html
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
NSAutoreleasePool のサンプル
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
NSAutoreleasePool のサンプル を以下に示す。</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="n">NSAutoreleasePool</span> <span class="o">*</span><span class="n">pool</span> <span class="o">=</span> <span class="p">[[</span><span class="n">NSAutoreleasePool</span> <span class="n">alloc</span><span class="p">]</span> <span class="n">init</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">  <span class="n">MyClass</span> <span class="o">*</span><span class="n">obj</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">obj</span> <span class="o">=</span> <span class="p">[[[</span><span class="n">MyClass</span> <span class="n">alloc</span><span class="p">]</span> <span class="nl">init</span><span class="p">:</span><span class="mi">0</span><span class="p">]</span><span class="n">autorelease</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">  <span class="n">obj</span> <span class="o">=</span> <span class="p">[[[</span><span class="n">MyClass</span> <span class="n">alloc</span><span class="p">]</span> <span class="nl">init</span><span class="p">:</span><span class="mi">1</span><span class="p">]</span><span class="n">autorelease</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">  <span class="n">NSLog</span><span class="p">(</span> <span class="s">@&#34;NSAutoreleasePool-0&#34;</span> <span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="n">pool</span> <span class="k">release</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">  <span class="n">NSLog</span><span class="p">(</span> <span class="s">@&#34;NSAutoreleasePool-1&#34;</span> <span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
上記サンプルを解説すると、</p>
<ul>
<li><code class="verbatim">[[NSAutoreleasePool alloc] init]</code> によって、オートリリースプールを生成する</li>
<li><code class="verbatim">[pool release];</code> によって、オートリリースプールを開放する</li>
<li>上記処理の間に <strong>autorelease メソッド</strong> が呼ばれたヒープオブジェクトは、
オートリリースプールに登録され、オートリリースプール開放時に、
登録されているヒープオブジェクト自体も release される。</li>
</ul>
<p>上記サンプルの出力は以下の通り。</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="n">NSAutoreleasePool</span><span class="o">-</span><span class="mi">0</span>
</span></span><span class="line"><span class="cl"><span class="n">MyClass</span> <span class="n">dealloc</span> <span class="o">--</span> <span class="nl">obj</span><span class="p">:</span><span class="mi">1</span>
</span></span><span class="line"><span class="cl"><span class="n">MyClass</span> <span class="n">dealloc</span> <span class="o">--</span> <span class="nl">obj</span><span class="p">:</span><span class="mi">0</span>
</span></span><span class="line"><span class="cl"><span class="n">NSAutoreleasePool</span><span class="o">-</span><span class="mi">1</span></span></span></code></pre></div>
</div>
<p>
上記出力を見ると、 <code class="verbatim">[pool release];</code> によって、
オートリリースプールに登録されている
ヒープオブジェクトの release が呼ばれ開放されていることが分かる。</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
<code class="verbatim">@autoreleasepool</code> のサンプル
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
<code class="verbatim">@autoreleasepool</code> は、
 NSAutoreleasePool のシンタックスシュガーである。</p>
<p>
次のコードと、</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="n">NSAutoreleasePool</span> <span class="o">*</span><span class="n">pool</span> <span class="o">=</span> <span class="p">[[</span><span class="n">NSAutoreleasePool</span> <span class="n">alloc</span><span class="p">]</span> <span class="n">init</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">  <span class="c1">// some codes
</span></span></span><span class="line"><span class="cl"><span class="c1"></span>  <span class="p">[</span><span class="n">pool</span> <span class="k">release</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></div>
</div>
<p>
次のコードは等価である。</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="k">@autoreleasepool</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="c1">// some codes
</span></span></span><span class="line"><span class="cl"><span class="c1"></span><span class="p">}</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
オートリリースプールの注意点
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
オートリリースプールを利用することで、メモリ管理の手間を削減できる。</p>
<p>
一方で、メモリの開放タイミングがオートリリースプール開放時になるため、
細かいメモリの開放制御を行えないデメリットもある。</p>
<p>
例えば、非常に大きいサイズのメモリを確保するような場合、
オートリリースプールに開放処理を任せてしまうと、
メモリ開放が後回しになってしまってヒープメモリを
圧迫してしまう可能性がある。</p>
<p>
オートリリースプールを使用する場合は、
オートリリースプール自体のライフサイクルを十分検討する必要がある。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
ARC
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>
オートリリースプールは、 
MRC で確保したヒープオブジェクトを登録することで
release を一括処理することを目的としていた。
そして、オートリリースプール自体の宣言は
依然としてコード上に記述する必要がある。</p>
<p>
一方で ARC は、基本的にコード上には何も記述する必要がない。
ただし、 ARC は MRC 上で成り立っている。</p>
<p>
これは、 retain や release を開発者がコードに記述する代わりに
ARC のランタイムで実行時に等価の処理を行なうようになる、
ということである。</p>
<p>
つまり、ARC は「変数がスマートポインタになる」と考えれば良い。</p>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
サンプル
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
次に ARC によるメモリ開放タイミングのサンプルを示す。</p>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl">  <span class="n">MyClass</span> <span class="o">*</span><span class="n">obj</span> <span class="o">=</span> <span class="p">[[</span><span class="n">MyClass</span> <span class="n">alloc</span><span class="p">]</span> <span class="nl">init</span><span class="p">:</span><span class="mi">2</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">  <span class="n">obj</span> <span class="o">=</span> <span class="p">[[</span><span class="n">MyClass</span> <span class="n">alloc</span><span class="p">]</span> <span class="nl">init</span><span class="p">:</span><span class="mi">3</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">  <span class="n">obj</span> <span class="o">=</span> <span class="nb">nil</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">  <span class="n">NSLog</span><span class="p">(</span><span class="s">@&#34;test&#34;</span><span class="p">);</span></span></span></code></pre></div>
</div>
<ul>
<li><code class="verbatim">[[MyClass alloc] init:2]</code> で、確保したオブジェクトが obj に代入される</li>
<li><code class="verbatim">[[MyClass alloc] init:3]</code> で、確保したオブジェクトが obj に代入される</li>
<li>この時、元々 obj に格納されていたオブジェクトの release が呼ばれ、開放される</li>
<li><code class="verbatim">obj = nil</code> で元々 obj に格納されていたオブジェクトの release が呼ばれ、開放される</li>
</ul>
<div class="src src-objc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-objc" data-lang="objc"><span class="line"><span class="cl"><span class="n">MyClass</span> <span class="n">dealloc</span> <span class="o">--</span> <span class="nl">obj</span><span class="p">:</span><span class="mi">2</span>
</span></span><span class="line"><span class="cl"><span class="n">MyClass</span> <span class="n">dealloc</span> <span class="o">--</span> <span class="nl">obj</span><span class="p">:</span><span class="mi">3</span>
</span></span><span class="line"><span class="cl"><span class="n">test</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
_strong, _weak 
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
ARC では、参照の度合いによって _strong, _weak の違いがある。
_strong は前述の通り変数がスマートポインタになる。
一方で _weak は参照だけして retain, release を行なわない。</p>
<p>
なお、 _strong, _weak どちらも宣言しない場合はデフォルト _strong になる。</p>
<p>
_weak は、循環参照に対処するケースで利用する。</p>
</div>
</div>
</div>
</div>
